module.exports.signs = [
    'Овен', 'Телец', 'Близцены', 'Рак',
    'Лев','Дева', 'Весы', 'Скорпион',
    'Стрелец', 'Козерог', 'Водолей', 'Рыбы'
]

const signs = {
    'Овен': [ 'Овен 1', 'Овен 2', 'Овен 3' ],
    'Телец': [ 'Телец 1', 'Телец 2', 'Телец 3' ],
    'Близцены': [ 'Близцены 1', 'Близцены 2', 'Близцены 3' ],
    'Рак': [ 'Рак 1', 'Рак 2', 'Рак 3' ],
    'Лев': [ 'Лев 1', 'Лев 2', 'Лев 3' ],
    'Дева': [ 'Дева 1', 'Дева 2', 'Дева 3' ],
    'Весы': [ 'Весы 1', 'Весы 2', 'Весы 3' ],
    'Скорпион': [ 'Скорпион 1', 'Скорпион 2', 'Скорпион 3' ],
    'Стрелец': [ 'Стрелец 1', 'Стрелец 2', 'Стрелец 3' ],
    'Козерог': [ 'Козерог 1', 'Козерог 2', 'Козерог 3' ],
    'Водолей': [ 'Водолей 1', 'Водолей 2', 'Водолей 3' ],
    'Рыбы': [ 'Рыбы 1', 'Рыбы 2', 'Рыбы 3' ]
}

const prediction = (sign) => signs[sign][Math.floor(Math.random() * signs[sign].length)]

module.exports.prediction = prediction
